app/views/users/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    <div class="username">
       <%= post.user.firstname%> <%= post.user.lastname%>