app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Titke"], ["body", "dgdfdgdhg"], ["created_at", "2020-03-30 09:48:06.577269"], ["updated_at", "2020-03-30 09:48:06.577269"], ["user_id", 24]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save