app/controllers/users_controller.rb

  def show
    @posts = current_user.posts.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."created_at" DESC  [["user_id", 24]]