app/controllers/users_controller.rb

UPDATE "users" SET "firstname" = $1, "lastname" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["firstname", "lerok"], ["lastname", "ovseychuk"], ["updated_at", "2020-03-30 21:35:48.889298"], ["id", 25]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)